In [ ]:
import pandas as pd
import numpy as np

In [2]:
import os
print(os.getcwd())  # 현재 작업 디렉터리 확

c:\SKN_19\python_basic\13_pandas

In [3]:
file_path = "./data/S_P500_Prices.csv"
sp500_df = pd.read_csv(file_path) 
sp500_df.info()
sp500_df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2159 entries, 0 to 2158
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sp500   2159 non-null   float64
dtypes: float64(1)
memory usage: 17.0 KB

             sp500
count  2159.000000
mean   2218.749554
std     537.321727
min    1278.040039
25%    1847.984985
50%    2106.629883
75%    2705.810059
max    3386.149902

In [4]:
sp500_df.head()
sp500_df.shape

(2159, 1)

In [5]:
sp500_df.squeeze()
sp500_df.shape

(2159, 1)

In [6]:
sp500_df[100:200]

           sp500
100  1315.130005
101  1314.989990
102  1325.660034
103  1308.930054
104  1324.180054
..           ...
195  1433.189941
196  1433.819946
197  1413.109985
198  1408.750000
199  1412.969971

[100 rows x 1 columns]

In [7]:
sp500_df.iloc[100:200]

           sp500
100  1315.130005
101  1314.989990
102  1325.660034
103  1308.930054
104  1324.180054
..           ...
195  1433.189941
196  1433.819946
197  1413.109985
198  1408.750000
199  1412.969971

[100 rows x 1 columns]

In [8]:
# fancy indexing (1000, 2000만 꺼내기)
sp500_ser = sp500_df["sp500"]

sp500_ser[sp500_ser > 1000]

0       1295.500000
1       1289.089966
2       1293.670044
3       1308.040039
4       1314.500000
           ...
2154    3327.770020
2155    3349.159912
2156    3351.280029
2157    3360.469971
2158    3333.689941
Name: sp500, Length: 2159, dtype: float64

In [9]:
print(3013.770020 in sp500_ser)
print(3013.770020 in sp500_ser.values)
print(1348259874247565643654367866652 in sp500_ser)
print(1348259874247565643654367866652 in sp500_ser.index)

False
True
False
False

In [10]:
print(sp500_ser.sort_values(ascending=False))

2037    3386.149902
2035    3380.159912
2033    3379.449951
2034    3373.939941
2038    3373.229980
           ...
2       1293.670044
1       1289.089966
99      1285.500000
98      1278.180054
97      1278.040039
Name: sp500, Length: 2159, dtype: float64

---
##### Dataframe 생성

In [ ]:
# 2차원 ndarray 활용
arr = np.random.randn(2, 3)
df = pd.DataFrame(arr)

df.index = ['ㄱ', 'ㄴ']
df.columns = ['A', 'B', 'C']


# dictionary-list 활용
data= {
    '숫자': [1,2,3,4,5],
    '한글': ['가', '나', '다', '라', '마'],
    '소수': [1.23, 2.34, 3.45, 4.56, 5.67],
    'boolean': True
}
df = pd.DataFrame(data)
print(df, end='\n')


# list-dictionary 활용
data = [
    {'a': 1, 'b': 2, 'c': 3},
    {'a': 4, 'b': 5, 'c': 6},
    {'a': 7, 'b': 8, 'c': 9}
]
df = pd.DataFrame(data)
print(df)

   숫자 한글    소수  boolean
0   1  가  1.23     True
1   2  나  2.34     True
2   3  다  3.45     True
3   4  라  4.56     True
4   5  마  5.67     True
   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [20]:
data = {
    '이름': ['토끼', '핀다', '코알라'],
    '위치': ['독산', '종로', '하남'],
    '성별': ['F', 'M', 'F']
}
df = pd.DataFrame(data)
df

    이름  위치 성별
0   토끼  독산  F
1   핀다  종로  M
2  코알라  하남  F

In [21]:
# 전치행렬
df.T

     0   1    2
이름  토끼  핀다  코알라
위치  독산  종로   하남
성별   F   M    F

---
##### DataFrame 속성

In [23]:
print(df.index)
print(df.columns)
print(df.values, type(df.values))

RangeIndex(start=0, stop=3, step=1)
Index(['이름', '위치', '성별'], dtype='object')
[['토끼' '독산' 'F']
 ['핀다' '종로' 'M']
 ['코알라' '하남' 'F']] <class 'numpy.ndarray'>

In [ ]:
bank_client_df = pd.DataFrame({
    'client_ID': [1, 2, 3, 4],
    'client Name': ['A', 'B', 'C', 'D'],
    'Net worth [$]': [100, 200, 300, 400],
    'year with bank': [1, 2, 3, 4]
})
df = pd.DataFrame(bank_client_df)
df

   client_ID client Name  Net worth [$]  year with bank
0          1           A            100               1
1          2           B            200               2
2          3           C            300               3
3          4           D            400               4

In [ ]:
# fancy indexing을 통한 조회결과는 1개여도 dp타입으로 반환
# - Series를 반환한다는 것은 차원을 축소(제거)하는 것
# - Dataframe을 반환한다는 것은 차원을 유지하는 것

In [39]:
data = {
    "Client Name": ["Alice", "Bob", "Steve", "Emma", "John"],
    "net worth": [100000, 250000, 500000, 750000, 300000],
    "Age": [28, 35, 40, 30, 45]
}

bank_client_df = pd.DataFrame(data)

print(bank_client_df)

  Client Name  net worth  Age
0       Alice     100000   28
1         Bob     250000   35
2       Steve     500000   40
3        Emma     750000   30
4        John     300000   45

In [37]:
# 이름이 Steve인 고객 정보 출력
# client name만 출력
# client name과 net worth 출력

print(bank_client_df[bank_client_df["Client Name"] == "Steve"], end='\n\n')
print(bank_client_df["Client Name"], end='\n\n')
print(bank_client_df[["Client Name", "net worth"]])

  Client Name  net worth  Age
2       Steve     500000   40

0    Alice
1      Bob
2    Steve
3     Emma
4     John
5     Emma
6     Emma
Name: Client Name, dtype: object

  Client Name  net worth
0       Alice     100000
1         Bob     250000
2       Steve     500000
3        Emma     750000
4        John     300000
5        Emma     750000
6        Emma     750000

In [30]:
# filter
bank_client_df.filter(items=['Client Name', 'net worth'])

  Client Name  net worth
0       Alice     100000
1         Bob     250000
2       Steve     500000
3        Emma     750000
4        John     300000

In [31]:
bank_client_df.filter(like='worth', axis=1)

   net worth
0     100000
1     250000
2     500000
3     750000
4     300000

In [34]:
bank_client_df.filter(like='3', axis=0)

  Client Name  net worth  Age
3        Emma     750000   30

In [46]:
# length는 last index보다 1 크기 때문에 하나 append한 셈
bank_client_df.loc[len(bank_client_df)] = ['Emma', 750000, 30]
bank_client_df

   Client Name  net worth  Age
0        Alice     100000   28
1          Bob     250000   35
2        Steve     500000   40
3         Emma     750000   30
4         John     300000   45
5         Emma     750000   30
6         Emma     750000   30
7         Emma     750000   30
8         Emma     750000   30
9         Emma     750000   30
10        Emma     750000   30
11        Emma     750000   30

In [55]:
# pd.concat() 이용
bank_client_df = pd.concat([bank_client_df, pd.DataFrame(['Hola', 19000, 40])], ignore_index=True)
bank_client_df = bank_client_df[:12]
bank_client_df

   Client Name  net worth   Age    0
0        Alice   100000.0  28.0  NaN
1          Bob   250000.0  35.0  NaN
2        Steve   500000.0  40.0  NaN
3         Emma   750000.0  30.0  NaN
4         John   300000.0  45.0  NaN
5         Emma   750000.0  30.0  NaN
6         Emma   750000.0  30.0  NaN
7         Emma   750000.0  30.0  NaN
8         Emma   750000.0  30.0  NaN
9         Emma   750000.0  30.0  NaN
10        Emma   750000.0  30.0  NaN
11        Emma   750000.0  30.0  NaN